ISSF_caseSetup/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1806/v10                             |
|   \  /    A nd           | Web:      https://www.OpenFOAM.com              |
|    \/     M anipulation  |           https://www.OpenFOAM.org              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
	(-0.35000000 -0.05000000 -0.01000000) // 0
	(0.85000000 -0.05000000 -0.01000000) // 1
	(0.85000000 0.05000000 -0.01000000) // 2
	(-0.35000000 0.05000000 -0.01000000) // 3
	(-0.35000000 -0.05000000 0.01000000) // 4
	(0.85000000 -0.05000000 0.01000000) // 5
	(0.85000000 0.05000000 0.01000000) // 6
	(-0.35000000 0.05000000 0.01000000) // 7
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 980 152 164 ) simpleGrading ( 1 ((0.1 36 41.22139901922649)(0.8 80 1)(0.1 36 0.024259244562116387)) ((0.1 42 82.53754217060246)(0.8 80 1)(0.1 42 0.012115698792351146)) ) // 0 
);

edges
(
);

faces
(
);

boundary
(
	bottom1
	{
		type patch;
		faces
		(
			(0 1 2 3)
		);
	}
	top1
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
	right1
	{
		type patch;
		faces
		(
			(4 5 1 0)
		);
	}
	outlet1
	{
		type patch;
		faces
		(
			(5 1 2 6)
		);
	}
	left1
	{
		type patch;
		faces
		(
			(7 6 2 3)
		);
	}
	inlet1
	{
		type patch;
		faces
		(
			(4 0 3 7)
		);
	}
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
