ISSF_caseSetup/0/fluid/B0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      B0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -2 0 0 -1 0 ];

#include setB;

internalField  $magneticField;

boundaryField
{
     fluid_inlet
    {
        type            zeroGradient;
    }
    fluid_outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
