ISSF_caseSetup/0/fluid/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ -1 -3 3 0 0 2 0 ];

sigma 883500.0 ;

internalField   uniform $sigma;

boundaryField
{
    fluid_inlet
    {
        type            zeroGradient;
    }
    fluid_outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            fixedValue;
        value           uniform $sigma ;
    }

    
}


// ************************************************************************* //
