ISSF_caseSetup/0/fluid/PotE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      PotE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 2 -3 0 0 -1 0 ];

internalField   uniform 0;

boundaryField
{
    fluid_inlet
    {
        type            zeroGradient;
    }
   fluid_outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
      type            solidWallMixedPotentialCoupled; // solidWallMixedTemperatureCoupled
       PotEnbr         PotE;                          // T
       sigma           sigma;
       value           uniform 0;
    }

}


// ************************************************************************* //
