ISSF_caseSetup/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions       [0 0 0 1 0 0 0];

Tw  300.0 ;

internalField   uniform $Tw;

boundaryField
{
    fluid_inlet
    {
        type        fixedValue;
        value       uniform $Tw ;
    }

    fluid_outlet
    {
        type       zeroGradient;
    }

    fluid_to_solid
    {
       type            solidWallMixedTemperatureCoupled; // solidWallMixedTemperatureCoupled
       PotEnbr         T;                                //
       K               K;
       value           uniform 300;
    }
}



// ************************************************************************* //
