ISSF_caseSetup/0/fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    fluid_inlet
    {
        type            zeroGradient;
    }
    fluid_outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            zeroGradient;
    }
   /* inner_wall
    {
        type            zeroGradient;
    } */
    
}


// ************************************************************************* //
