ISSF_caseSetup/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions       [0 0 0 1 0 0 0];

Tw  573.0 ;

internalField   uniform $Tw;

boundaryField
{

     solid_inlet
    {
        type            zeroGradient;
    }
    solid_outlet
    {
        type            zeroGradient;
    }
    heater
    {
        type            fixedGradient;
	gradient   -qw/k ;
    }

    exterior
    {
        type            zeroGradient;
    }
    solid_to_fluid
    {
        type        zeroGradient; // new BC
    }
   

}



// ************************************************************************* //
