ISSF_caseSetup/0/solid/sigma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ -1 -3 3 0 0 2 0 ];

internalField     uniform 1.09e+06;

boundaryField
{


    solid_inlet
    {
        type            zeroGradient;
    }
    solid_outlet
    {
        type            zeroGradient;
    }
    heater
    {
        type            zeroGradient;
    }

    exterior
    {
        type            zeroGradient;
    }
    solid_to_fluid
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //

