ISSF_caseSetup/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }


    "(U|T)"
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-06;
        relTol 0.01;
    }
    "(U|T)Final"
    {
        $U;
        tolerance 1e-06;
        relTol 0;
    }

   PotE
    {
      solver GAMG;
        smoother        GaussSeidel;
        tolerance 1e-06;
        relTol 0.001;
    };
    PotEFinal
    {
        $PotE;
        smoother        DICGaussSeidel;
       tolerance 1e-06;
    };

   
}

PIMPLE
{
    nOuterCorrectors 5; // increase to 10
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    pRefCell 1001;
    pRefValue 0;
    PotERefCell               0;
    PotERefValue              0;
    TRefCell                  573;
    TRefValue                 573;


    
     residualControl
    {
        p
        {
            relTol  0;
            // if this tolerance is reached, leave
            tolerance 1e-04;
        }
        U
        {
            relTol  0;
            // if this tolerance is reached, leave
            tolerance 1e-04;
        }
        T
        {
            relTol  0;
            // if this tolerance is reached, leave
            tolerance 1e-04;
        }

    }


}

relaxationFactors
{
    fields
    {
        p       0.7;
        pFinal  0.9; // Last outer loop

    }
    equations
    {
        U       0.9;
        UFinal  0.9;
        T       0.9;
        TFinal  0.9;
        PotE      0.9;
        PotEFinal 0.9;
    }
}

PotE
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    PotERefCell        0;
    PotERefValue       0;
}


// ************************************************************************* //
