ISSF_caseSetup/system/fluid/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 128;

method          scotch;

simpleCoeffs
{
    n               (1 1 1);
    delta           0.001;
}
constraints
{
   // Keep owner and neighbour on same processor for faces in patches
    // (only makes sense for cyclic patches. Not suitable for e.g.
    // cyclicAMI since these are not coupled on the patch level.
    // Use singleProcessorFaceSets for those.
    patches
    {
        type    preservePatches;
        patches (fluid_inlet fluid_outlet);
        enabled true;
    }
}



// ************************************************************************* //
